<h1 style='text-align: center'>SQL Queries</h1>

## Getting Data From A SQL Database

### The Structure of a SQL Query

<img src='images/sql_statement.jpg'/>

#### SELECT

- What columns of data do we want? 
- Specify by column names or * (All)

FROM

- Where are we getting our data from? 
- Specify by table name or use join statement to join multiple tables

##### JOIN

- Use to join multiple tables 
- SELECT * FROM students join favorite_foods on students.id = favorite_foods.student_id
- SELECT * FROM students as s join favorite_foods as f on s.id = f.student_id

#### WHERE

- apply some filter to the data you are querying 
- define criteria for data that should selected from the database 
- SELECT * from students WHERE age > 10

#### GROUP BY

- Group columns by similar values
- SELECT COUNT(id), city from students GROUP BY city

#### HAVING

- Use to apply filter AFTER you have made your initial query 
- When should we use HAVING instead of WHERE

In [53]:
import sqlite3
import pandas as pd
conn = sqlite3.connect('tutorial.db')
c = conn.cursor()

In [5]:
# Load students.json file

#your code here
import json
f=open('students.json','r')
data=json.load(f)

In [7]:
data

[{'name': 'Sean Abu Wilson',
  'birthdate': '02/06',
  'siblings': 2,
  'Birthplace': 'Birmingham, AL',
  'yearsinnyc': 7.8,
  'favoritefood': 'guacamole'},
 {'name': 'Tawab',
  'birthdate': '04/08/1998',
  'siblings': 4,
  'Birthplace': 'Afghanistan',
  'yearsinnyc': 0.5,
  'favoritefood': 'pizza'},
 {'name': 'Bridget Boakye',
  'birthdate': '1990-07-13',
  'siblings': 3,
  'Birthplace': 'Accra',
  'yearsinnyc': 15,
  'favoritefood': 'Indian'},
 {'name': 'Cristina',
  'birthdate': '9/9/1990',
  'siblings': 2,
  'Birthplace': 'Spain',
  'yearsinnyc': 6,
  'favoritefood': 'Sushi'},
 {'name': 'Danny (Haoyang) Yu',
  'birthdate': '1997-03-19',
  'siblings': 2,
  'Birthplace': '1997-03-19',
  'yearsinnyc': 0,
  'favoritefood': 'Galbi'},
 {'name': 'Dustin_Breitner',
  'birthdate': '04/15/94',
  'siblings': 2,
  'Birthplace': 'New_York',
  'yearsinnyc': 3,
  'favoritefood': 'Pizza'},
 {'name': 'Gregory DeSantis',
  'birthdate': '1987-11-23',
  'siblings': 2,
  'Birthplace': 'Highland Park, NJ',
  'yearsinnyc': 13,
  'favoritefood': 'Pizza'},
 {'name': 'Harrison Miller',
  'birthdate': '10/2/85',
  'siblings': 0,
  'Birthplace': 'New Jersey',
  'yearsinnyc': 0,
  'favoritefood': 'Pizza'},
 {'name': 'Jeremy Owens',
  'birthdate': '03/30/1990',
  'siblings': 0,
  'Birthplace': 'Virginia',
  'yearsinnyc': 6,
  'favoritefood': 'Avocado'},
 {'name': 'Jeremy Reikes',
  'birthdate': '1-/12/1995',
  'siblings': 1,
  'Birthplace': 'New York City',
  'yearsinnyc': 23,
  'favoritefood': 'Pizza'},
 {'name': 'Johnathan Peck',
  'birthdate': '02-19-1994',
  'siblings': 2,
  'Birthplace': 'New York',
  'yearsinnyc': 25,
  'favoritefood': 'Moms food'},
 {'name': 'Minna F',
  'birthdate': '11-19-1996',
  'siblings': 3,
  'Birthplace': 'San Francisco',
  'yearsinnyc': 1,
  'favoritefood': 'sushi'},
 {'name': 'Nabil Abbas',
  'birthdate': '12-07-1994',
  'siblings': 2,
  'Birthplace': 'Long Island',
  'yearsinnyc': 6,
  'favoritefood': 'Gyro'},
 {'name': 'Natalie Del Rossi',
  'birthdate': '10-23-1994',
  'siblings': 0,
  'Birthplace': 'Brooklyn',
  'yearsinnyc': 18,
  'favoritefood': 'pizza'},
 {'name': 'Remy Canario',
  'birthdate': '10-11-1988',
  'siblings': 0,
  'Birthplace': 'New York',
  'yearsinnyc': 28,
  'favoritefood': 'toast'},
 {'name': 'Xristos Katsaros',
  'birthdate': '03-24-1986',
  'siblings': 1,
  'Birthplace': 'Chicago Heights, IL',
  'yearsinnyc': 3,
  'favoritefood': 'Pizza'}]

In [8]:
data[0]

{'name': 'Sean Abu Wilson',
 'birthdate': '02/06',
 'siblings': 2,
 'Birthplace': 'Birmingham, AL',
 'yearsinnyc': 7.8,
 'favoritefood': 'guacamole'}

In [27]:
c.execute('''
CREATE TABLE IF NOT EXISTS students (name TEXT, birthdate TEXT, siblings INT, Birthplace TEXT, yearsinnyc INT, favoritefood TEXT);''')

conn.commit()

In [30]:
# dynamic data entry example
def dynamic_data_entry(person):
    
    c.execute('''INSERT INTO students (name, birthdate, siblings, Birthplace, yearsinnyc, favoritefood) VALUES (?, ?, ?, ?, ?, ?)

''',(person['name'],person ['birthdate'],person['siblings'],person['Birthplace'], person ['yearsinnyc'],person['favoritefood']))
    
    conn.commit()

In [32]:
for person in data:
    dynamic_data_entry(person)

### Questions
1. What are the names of all of the students?
2. Which student has the most siblings?
3. How many students are only children?
4. Which 3 students have lived in NYC the shortest amount of time?
5. How many students are native New Yorkers?
6. Do any two students have the same favorite food?
7. Which student was born closest to the cohort's graduation date?

In [33]:
c.execute('''SELECT name FROM students''').fetchall()

[('Sean Abu Wilson',),
 ('Sean Abu Wilson',),
 ('Tawab',),
 ('Bridget Boakye',),
 ('Cristina',),
 ('Danny (Haoyang) Yu',),
 ('Dustin_Breitner',),
 ('Gregory DeSantis',),
 ('Harrison Miller',),
 ('Jeremy Owens',),
 ('Jeremy Reikes',),
 ('Johnathan Peck',),
 ('Minna F',),
 ('Nabil Abbas',),
 ('Natalie Del Rossi',),
 ('Remy Canario',),
 ('Xristos Katsaros',)]

In [34]:
c.execute('''SELECT * FROM students ORDER BY siblings DESC LIMIT 1''').fetchall()

[('Tawab', '04/08/1998', 4, 'Afghanistan', 0.5, 'pizza')]

In [35]:
c.execute('''SELECT * FROM students WHERE siblings = 0;''').fetchall()

[('Harrison Miller', '10/2/85', 0, 'New Jersey', 0, 'Pizza'),
 ('Jeremy Owens', '03/30/1990', 0, 'Virginia', 6, 'Avocado'),
 ('Natalie Del Rossi', '10-23-1994', 0, 'Brooklyn', 18, 'pizza'),
 ('Remy Canario', '10-11-1988', 0, 'New York', 28, 'toast')]

In [36]:
c.execute("""SELECT * FROM students ORDER BY yearsinnyc LIMIT 3;""").fetchall()

[('Danny (Haoyang) Yu', '1997-03-19', 2, '1997-03-19', 0, 'Galbi'),
 ('Harrison Miller', '10/2/85', 0, 'New Jersey', 0, 'Pizza'),
 ('Tawab', '04/08/1998', 4, 'Afghanistan', 0.5, 'pizza')]

In [37]:
c.execute('''SELECT name FROM students WHERE siblings = (select max (siblings)from students)''').fetchall()

[('Tawab',)]

In [39]:
c.execute('''SELECT name FROM students WHERE Birthplace = "New York";''').fetchall()

[('Johnathan Peck',), ('Remy Canario',)]

In [43]:
c.execute(''' SELECT * FROM students where favoritefood = favoritefood GROUP BY favoritefood;''').fetchall()

[('Jeremy Owens', '03/30/1990', 0, 'Virginia', 6, 'Avocado'),
 ('Danny (Haoyang) Yu', '1997-03-19', 2, '1997-03-19', 0, 'Galbi'),
 ('Nabil Abbas', '12-07-1994', 2, 'Long Island', 6, 'Gyro'),
 ('Bridget Boakye', '1990-07-13', 3, 'Accra', 15, 'Indian'),
 ('Johnathan Peck', '02-19-1994', 2, 'New York', 25, 'Moms food'),
 ('Dustin_Breitner', '04/15/94', 2, 'New_York', 3, 'Pizza'),
 ('Cristina', '9/9/1990', 2, 'Spain', 6, 'Sushi'),
 ('Sean Abu Wilson', '02/06', 2, 'Birmingham, AL', 7.8, 'guacamole'),
 ('Tawab', '04/08/1998', 4, 'Afghanistan', 0.5, 'pizza'),
 ('Minna F', '11-19-1996', 3, 'San Francisco', 1, 'sushi'),
 ('Remy Canario', '10-11-1988', 0, 'New York', 28, 'toast')]

In [48]:
c.execute('''SELECT * FROM students ORDER BY birthdate;''').fetchall()

[('Johnathan Peck', '02-19-1994', 2, 'New York', 25, 'Moms food'),
 ('Sean Abu Wilson', '02/06', 2, 'Birmingham, AL', 7.8, 'guacamole'),
 ('Sean Abu Wilson', '02/06', 2, 'Birmingham, AL', 7.8, 'guacamole'),
 ('Xristos Katsaros', '03-24-1986', 1, 'Chicago Heights, IL', 3, 'Pizza'),
 ('Jeremy Owens', '03/30/1990', 0, 'Virginia', 6, 'Avocado'),
 ('Tawab', '04/08/1998', 4, 'Afghanistan', 0.5, 'pizza'),
 ('Dustin_Breitner', '04/15/94', 2, 'New_York', 3, 'Pizza'),
 ('Jeremy Reikes', '1-/12/1995', 1, 'New York City', 23, 'Pizza'),
 ('Remy Canario', '10-11-1988', 0, 'New York', 28, 'toast'),
 ('Natalie Del Rossi', '10-23-1994', 0, 'Brooklyn', 18, 'pizza'),
 ('Harrison Miller', '10/2/85', 0, 'New Jersey', 0, 'Pizza'),
 ('Minna F', '11-19-1996', 3, 'San Francisco', 1, 'sushi'),
 ('Nabil Abbas', '12-07-1994', 2, 'Long Island', 6, 'Gyro'),
 ('Gregory DeSantis', '1987-11-23', 2, 'Highland Park, NJ', 13, 'Pizza'),
 ('Bridget Boakye', '1990-07-13', 3, 'Accra', 15, 'Indian'),
 ('Danny (Haoyang) Yu', '1997-03-19', 2, '1997-03-19', 0, 'Galbi'),
 ('Cristina', '9/9/1990', 2, 'Spain', 6, 'Sushi')]

In [51]:
c.execute('''ALTER TABLE students ADD dob date;''')
conn.commit

In [54]:
c.execute("""SELECT * FROM students""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df.head()

,name,birthdate,siblings,Birthplace,yearsinnyc,favoritefood,dob
0,Sean Abu Wilson,02/06,2,"Birmingham, AL",7.8,guacamole,None
1,Sean Abu Wilson,02/06,2,"Birmingham, AL",7.8,guacamole,None
2,Tawab,04/08/1998,4,Afghanistan,0.5,pizza,None
3,Bridget Boakye,1990-07-13,3,Accra,15.0,Indian,None
4,Cristina,9/9/1990,2,Spain,6.0,Sushi,None